Tekla Open API Reference for Tekla Structures 2025
AnalysisObject.AnalysisModelName Property
 Gets or sets the analysis model name.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string AnalysisModelName { get; set; }
Public Property AnalysisModelName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
AnalysisObject Class
Tekla.Structures.Analysis Namespace